Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_EllipseProfile
The IFC2X3_ParametricObject_EllipseProfile class contains the ellipse profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_EllipseProfile.SemiAxis1
The first semi-axis.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_EllipseProfile.SemiAxis2
The second semi-axis.